testfiles/runMongodb_13:40_08-05-2016.txt
java -cp /home/ubuntu/YCSB/mongodb-binding/conf:/home/ubuntu/YCSB/conf:/home/ubuntu/YCSB/lib/jackson-mapper-asl-1.9.4.jar:/home/ubuntu/YCSB/lib/core-0.8.0.jar:/home/ubuntu/YCSB/lib/HdrHistogram-2.1.4.jar:/home/ubuntu/YCSB/lib/jackson-core-asl-1.9.4.jar:/home/ubuntu/YCSB/mongodb-binding/lib/mongo-java-driver-3.0.3.jar:/home/ubuntu/YCSB/mongodb-binding/lib/slf4j-api-1.6.4.jar:/home/ubuntu/YCSB/mongodb-binding/lib/mongodb-binding-0.8.0.jar:/home/ubuntu/YCSB/mongodb-binding/lib/logback-core-1.1.2.jar:/home/ubuntu/YCSB/mongodb-binding/lib/mongodb-async-driver-2.0.1.jar:/home/ubuntu/YCSB/mongodb-binding/lib/logback-classic-1.1.2.jar com.yahoo.ycsb.Client -db com.yahoo.ycsb.db.AsyncMongoDbClient -s -P workloads/workloadb -p mongodb.url=mongodb://134.60.64.243:27017/ycsb?w=0 -t
YCSB Client 0.8.0
Command line: -db com.yahoo.ycsb.db.AsyncMongoDbClient -s -P workloads/workloadb -p mongodb.url=mongodb://134.60.64.243:27017/ycsb?w=0 -t
Loading workload...
Starting test.
2016-05-08 13:40:50:936 0 sec: 0 operations; est completion in 0 seconds 
mongo connection created with mongodb://134.60.64.243:27017/ycsb?w=0
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
13:40:51.028 [Thread-1] DEBUG c.a.m.c.c.b.BootstrapConnectionFactory - Sharded bootstrap to omistack-vm243.e-technik.uni-ulm.de/134.60.64.243:27017.
13:40:51.038 [Thread-1] DEBUG c.a.m.c.c.s.ShardedConnectionFactory - Adding shard mongos: mongodb-1:27017
13:40:51.042 [Thread-1] INFO  c.a.m.client.state.ClusterPinger - Could not ping 'mongodb-1:27017': mongodb-1
2016-05-08 13:41:00:936 10 sec: 8223 operations; 822.22 current ops/sec; est completion in 20 minutes [READ: Count=7789, Max=64831, Min=387, Avg=1263.55, 90=2019, 99=4919, 99.9=11079, 99.99=30447] [UPDATE-FAILED: Count=434, Max=1070, Min=15, Avg=85.18, 90=147, 99=325, 99.9=1070, 99.99=1070] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:41:10:936 20 sec: 16631 operations; 840.8 current ops/sec; est completion in 19 minutes [READ: Count=7972, Max=40063, Min=387, Avg=1247.3, 90=2125, 99=4959, 99.9=8751, 99.99=26527] [UPDATE-FAILED: Count=438, Max=2899, Min=9, Avg=41.07, 90=54, 99=127, 99.9=2899, 99.99=2899] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:41:20:937 30 sec: 26051 operations; 942 current ops/sec; est completion in 18 minutes [READ: Count=8981, Max=12991, Min=393, Avg=1108.48, 90=1884, 99=3755, 99.9=7535, 99.99=11743] [UPDATE-FAILED: Count=437, Max=473, Min=8, Avg=26.66, 90=44, 99=64, 99.9=473, 99.99=473] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:41:30:936 40 sec: 35498 operations; 944.7 current ops/sec; est completion in 18 minutes [READ: Count=8973, Max=17615, Min=405, Avg=1109.38, 90=1897, 99=3629, 99.9=7175, 99.99=14247] [UPDATE-FAILED: Count=474, Max=94, Min=7, Avg=25.69, 90=44, 99=58, 99.9=94, 99.99=94] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:41:40:936 50 sec: 45143 operations; 964.5 current ops/sec; est completion in 17 minutes [READ: Count=9147, Max=110207, Min=395, Avg=1089.02, 90=1825, 99=4423, 99.9=26111, 99.99=87743] [UPDATE-FAILED: Count=498, Max=57, Min=6, Avg=22.67, 90=37, 99=53, 99.9=57, 99.99=57] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:41:50:936 60 sec: 54460 operations; 931.7 current ops/sec; est completion in 17 minutes [READ: Count=8859, Max=47263, Min=380, Avg=1124.09, 90=1884, 99=5331, 99.9=21231, 99.99=31471] [UPDATE-FAILED: Count=458, Max=1882, Min=10, Avg=27.69, 90=39, 99=59, 99.9=1882, 99.99=1882] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:42:00:936 70 sec: 64424 operations; 996.4 current ops/sec; est completion in 16 minutes [READ: Count=9471, Max=20495, Min=384, Avg=1050.54, 90=1899, 99=3699, 99.9=7251, 99.99=17823] [UPDATE-FAILED: Count=493, Max=2639, Min=7, Avg=28.08, 90=31, 99=62, 99.9=2639, 99.99=2639] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:42:10:936 80 sec: 72609 operations; 818.5 current ops/sec; est completion in 17 minutes [READ: Count=7772, Max=52351, Min=384, Avg=1282.06, 90=2129, 99=7039, 99.9=28815, 99.99=44447] [UPDATE-FAILED: Count=413, Max=60, Min=7, Avg=21.28, 90=32, 99=52, 99.9=60, 99.99=60] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:42:20:936 90 sec: 79013 operations; 640.4 current ops/sec; est completion in 17 minutes [READ: Count=6067, Max=82495, Min=383, Avg=1646.43, 90=2009, 99=19199, 99.9=51007, 99.99=78399] [UPDATE-FAILED: Count=337, Max=69, Min=6, Avg=20.17, 90=31, 99=51, 99.9=69, 99.99=69] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:42:30:936 100 sec: 88902 operations; 988.9 current ops/sec; est completion in 17 minutes [READ: Count=9401, Max=36863, Min=389, Avg=1060.87, 90=1841, 99=4451, 99.9=9679, 99.99=24623] [UPDATE-FAILED: Count=489, Max=61, Min=6, Avg=19.55, 90=30, 99=48, 99.9=61, 99.99=61] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:42:40:936 110 sec: 97699 operations; 879.7 current ops/sec; est completion in 16 minutes [READ: Count=8368, Max=77247, Min=396, Avg=1191.82, 90=1964, 99=5019, 99.9=24159, 99.99=66943] [UPDATE-FAILED: Count=430, Max=50, Min=6, Avg=18.08, 90=23, 99=48, 99.9=50, 99.99=50] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:42:50:936 120 sec: 107208 operations; 950.9 current ops/sec; est completion in 16 minutes [READ: Count=9033, Max=43103, Min=375, Avg=1103.38, 90=1934, 99=5059, 99.9=16135, 99.99=40383] [UPDATE-FAILED: Count=474, Max=723, Min=6, Avg=21.39, 90=31, 99=65, 99.9=723, 99.99=723] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:43:00:936 130 sec: 117283 operations; 1007.5 current ops/sec; est completion in 16 minutes [READ: Count=9602, Max=26303, Min=365, Avg=1034.83, 90=1842, 99=4727, 99.9=14975, 99.99=24207] [UPDATE-FAILED: Count=473, Max=80, Min=6, Avg=18.37, 90=29, 99=48, 99.9=80, 99.99=80] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:43:10:936 140 sec: 127577 operations; 1029.4 current ops/sec; est completion in 15 minutes [READ: Count=9764, Max=18495, Min=391, Avg=1021.36, 90=1829, 99=3611, 99.9=6739, 99.99=9247] [UPDATE-FAILED: Count=530, Max=52, Min=5, Avg=17.36, 90=28, 99=44, 99.9=49, 99.99=52] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:43:20:936 150 sec: 137504 operations; 992.7 current ops/sec; est completion in 15 minutes [READ: Count=9440, Max=34463, Min=401, Avg=1056.53, 90=1832, 99=4751, 99.9=14623, 99.99=31407] [UPDATE-FAILED: Count=487, Max=656, Min=5, Avg=17.55, 90=24, 99=43, 99.9=656, 99.99=656] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:43:30:936 160 sec: 148057 operations; 1055.3 current ops/sec; est completion in 15 minutes [READ: Count=9996, Max=19551, Min=392, Avg=997.61, 90=1788, 99=3505, 99.9=6559, 99.99=17439] [UPDATE-FAILED: Count=557, Max=109, Min=4, Avg=16.49, 90=26, 99=44, 99.9=52, 99.99=109] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:43:40:936 170 sec: 158772 operations; 1071.5 current ops/sec; est completion in 15 minutes [READ: Count=10150, Max=15559, Min=378, Avg=982.38, 90=1801, 99=3597, 99.9=7047, 99.99=8967] [UPDATE-FAILED: Count=565, Max=76, Min=4, Avg=15.78, 90=25, 99=45, 99.9=70, 99.99=76] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:43:50:936 180 sec: 168206 operations; 943.4 current ops/sec; est completion in 14 minutes [READ: Count=8934, Max=90175, Min=381, Avg=1116.77, 90=1825, 99=5967, 99.9=26479, 99.99=41055] [UPDATE-FAILED: Count=500, Max=61, Min=5, Avg=14.43, 90=21, 99=40, 99.9=61, 99.99=61] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:44:00:936 190 sec: 178644 operations; 1043.8 current ops/sec; est completion in 14 minutes [READ: Count=9921, Max=43135, Min=369, Avg=1005.26, 90=1789, 99=4739, 99.9=13959, 99.99=28271] [UPDATE-FAILED: Count=517, Max=52, Min=4, Avg=14.4, 90=22, 99=37, 99.9=45, 99.99=52] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:44:10:936 200 sec: 188242 operations; 959.8 current ops/sec; est completion in 14 minutes [READ: Count=9116, Max=90303, Min=366, Avg=1091.09, 90=1795, 99=6863, 99.9=23263, 99.99=47295] [UPDATE-FAILED: Count=482, Max=4081, Min=5, Avg=24.54, 90=24, 99=42, 99.9=4081, 99.99=4081] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:44:20:936 210 sec: 195178 operations; 693.6 current ops/sec; est completion in 14 minutes [READ: Count=6598, Max=73087, Min=377, Avg=1513.08, 90=1942, 99=18255, 99.9=46495, 99.99=68799] [UPDATE-FAILED: Count=338, Max=48, Min=4, Avg=15.2, 90=26, 99=38, 99.9=48, 99.99=48] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:44:30:936 220 sec: 205603 operations; 1042.5 current ops/sec; est completion in 14 minutes [READ: Count=9922, Max=41247, Min=404, Avg=1003.97, 90=1817, 99=3891, 99.9=9183, 99.99=30847] [UPDATE-FAILED: Count=503, Max=7767, Min=5, Avg=31.34, 90=28, 99=46, 99.9=57, 99.99=7767] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:44:40:936 230 sec: 216050 operations; 1044.7 current ops/sec; est completion in 13 minutes [READ: Count=9927, Max=40607, Min=397, Avg=1004.36, 90=1821, 99=4159, 99.9=10119, 99.99=40319] [UPDATE-FAILED: Count=520, Max=49, Min=5, Avg=14.12, 90=19, 99=39, 99.9=43, 99.99=49] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:44:50:936 240 sec: 225051 operations; 900.1 current ops/sec; est completion in 13 minutes [READ: Count=8552, Max=41247, Min=370, Avg=1166.17, 90=1897, 99=6799, 99.9=23871, 99.99=39103] [UPDATE-FAILED: Count=450, Max=49, Min=4, Avg=15, 90=26, 99=39, 99.9=49, 99.99=49] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:45:00:936 250 sec: 235805 operations; 1075.4 current ops/sec; est completion in 13 minutes [READ: Count=10201, Max=9023, Min=389, Avg=977.44, 90=1812, 99=3475, 99.9=6231, 99.99=7999] [UPDATE-FAILED: Count=552, Max=75, Min=4, Avg=14.85, 90=25, 99=40, 99.9=44, 99.99=75] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:45:10:936 260 sec: 246525 operations; 1072 current ops/sec; est completion in 13 minutes [READ: Count=10208, Max=37631, Min=382, Avg=976.64, 90=1784, 99=3977, 99.9=7155, 99.99=23023] [UPDATE-FAILED: Count=512, Max=5095, Min=5, Avg=24.19, 90=23, 99=39, 99.9=93, 99.99=5095] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:45:20:936 270 sec: 257178 operations; 1065.3 current ops/sec; est completion in 13 minutes [READ: Count=10098, Max=29215, Min=399, Avg=987.52, 90=1791, 99=4055, 99.9=7831, 99.99=24223] [UPDATE-FAILED: Count=555, Max=48, Min=4, Avg=14.76, 90=26, 99=40, 99.9=42, 99.99=48] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:45:30:936 280 sec: 267845 operations; 1066.7 current ops/sec; est completion in 12 minutes [READ: Count=10143, Max=23071, Min=395, Avg=982.91, 90=1830, 99=3659, 99.9=6663, 99.99=15655] [UPDATE-FAILED: Count=524, Max=80, Min=4, Avg=14.84, 90=26, 99=40, 99.9=51, 99.99=80] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:45:40:936 290 sec: 279098 operations; 1125.3 current ops/sec; est completion in 12 minutes [READ: Count=10685, Max=9903, Min=367, Avg=933.4, 90=1728, 99=3513, 99.9=6855, 99.99=9775] [UPDATE-FAILED: Count=568, Max=78, Min=4, Avg=13.9, 90=21, 99=39, 99.9=71, 99.99=78] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:45:50:936 300 sec: 287744 operations; 864.6 current ops/sec; est completion in 12 minutes [READ: Count=8196, Max=155263, Min=387, Avg=1216.35, 90=1861, 99=9967, 99.9=32623, 99.99=42847] [UPDATE-FAILED: Count=450, Max=61, Min=4, Avg=14.23, 90=21, 99=39, 99.9=61, 99.99=61] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:46:00:936 310 sec: 299151 operations; 1140.7 current ops/sec; est completion in 12 minutes [READ: Count=10830, Max=42559, Min=381, Avg=921.73, 90=1735, 99=3817, 99.9=7503, 99.99=41023] [UPDATE-FAILED: Count=577, Max=71, Min=4, Avg=13.82, 90=18, 99=37, 99.9=43, 99.99=71] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:46:10:936 320 sec: 308716 operations; 956.5 current ops/sec; est completion in 11 minutes [READ: Count=9100, Max=45151, Min=402, Avg=1095.35, 90=1818, 99=6907, 99.9=20463, 99.99=39295] [UPDATE-FAILED: Count=465, Max=40, Min=4, Avg=13.54, 90=19, 99=33, 99.9=40, 99.99=40] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:46:20:936 330 sec: 315040 operations; 632.4 current ops/sec; est completion in 11 minutes [READ: Count=6005, Max=76799, Min=403, Avg=1663.87, 90=2053, 99=22767, 99.9=43999, 99.99=70335] [UPDATE-FAILED: Count=319, Max=44, Min=5, Avg=14.8, 90=19, 99=41, 99.9=44, 99.99=44] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:46:30:936 340 sec: 325864 operations; 1082.4 current ops/sec; est completion in 11 minutes [READ: Count=10275, Max=18639, Min=381, Avg=970.44, 90=1804, 99=3697, 99.9=7019, 99.99=9839] [UPDATE-FAILED: Count=549, Max=80, Min=4, Avg=13.52, 90=19, 99=43, 99.9=52, 99.99=80] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:46:40:936 350 sec: 336893 operations; 1102.9 current ops/sec; est completion in 11 minutes [READ: Count=10505, Max=10607, Min=389, Avg=948.94, 90=1761, 99=3557, 99.9=6515, 99.99=9551] [UPDATE-FAILED: Count=524, Max=40, Min=4, Avg=13.77, 90=19, 99=32, 99.9=39, 99.99=40] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:46:50:936 360 sec: 346310 operations; 941.7 current ops/sec; est completion in 11 minutes [READ: Count=8934, Max=50143, Min=399, Avg=1116.41, 90=1866, 99=6023, 99.9=24671, 99.99=36799] [UPDATE-FAILED: Count=484, Max=41, Min=5, Avg=14.39, 90=19, 99=39, 99.9=41, 99.99=41] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:47:00:936 370 sec: 356764 operations; 1045.4 current ops/sec; est completion in 11 minutes [READ: Count=9936, Max=33215, Min=388, Avg=1003.37, 90=1794, 99=4643, 99.9=13583, 99.99=31759] [UPDATE-FAILED: Count=517, Max=40, Min=4, Avg=14.51, 90=23, 99=39, 99.9=40, 99.99=40] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:47:10:936 380 sec: 367894 operations; 1113 current ops/sec; est completion in 10 minutes [READ: Count=10562, Max=15663, Min=399, Avg=943.94, 90=1759, 99=3343, 99.9=6499, 99.99=8083] [UPDATE-FAILED: Count=568, Max=73, Min=4, Avg=14.54, 90=21, 99=33, 99.9=42, 99.99=73] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:47:20:936 390 sec: 378725 operations; 1083.1 current ops/sec; est completion in 10 minutes [READ: Count=10324, Max=25695, Min=387, Avg=966.05, 90=1800, 99=3325, 99.9=7111, 99.99=16015] [UPDATE-FAILED: Count=507, Max=70, Min=5, Avg=15.54, 90=23, 99=52, 99.9=63, 99.99=70] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:47:30:936 400 sec: 389255 operations; 1053 current ops/sec; est completion in 10 minutes [READ: Count=10008, Max=10127, Min=413, Avg=995.6, 90=1834, 99=3593, 99.9=6339, 99.99=8943] [UPDATE-FAILED: Count=523, Max=8735, Min=4, Avg=32.34, 90=22, 99=39, 99.9=57, 99.99=8735] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:47:40:936 410 sec: 400298 operations; 1104.3 current ops/sec; est completion in 10 minutes [READ: Count=10491, Max=18703, Min=400, Avg=950.29, 90=1776, 99=3437, 99.9=7275, 99.99=18079] [UPDATE-FAILED: Count=551, Max=74, Min=5, Avg=15.38, 90=23, 99=32, 99.9=48, 99.99=74] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:47:50:936 420 sec: 409492 operations; 919.4 current ops/sec; est completion in 10 minutes [READ: Count=8735, Max=51679, Min=396, Avg=1142.01, 90=1845, 99=7079, 99.9=26575, 99.99=43935] [UPDATE-FAILED: Count=460, Max=115, Min=4, Avg=16.64, 90=29, 99=43, 99.9=115, 99.99=115] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:48:00:936 430 sec: 419010 operations; 951.8 current ops/sec; est completion in 9 minutes [READ: Count=9032, Max=43135, Min=398, Avg=1103.56, 90=1960, 99=5415, 99.9=17919, 99.99=38399] [UPDATE-FAILED: Count=485, Max=53, Min=4, Avg=15.41, 90=26, 99=40, 99.9=53, 99.99=53] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:48:10:936 440 sec: 427987 operations; 897.7 current ops/sec; est completion in 9 minutes [READ: Count=8544, Max=45407, Min=405, Avg=1166.87, 90=1915, 99=7387, 99.9=25103, 99.99=38367] [UPDATE-FAILED: Count=433, Max=54, Min=4, Avg=15.89, 90=28, 99=42, 99.9=54, 99.99=54] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:48:20:936 450 sec: 435456 operations; 746.9 current ops/sec; est completion in 9 minutes [READ: Count=7074, Max=69055, Min=383, Avg=1411.38, 90=1869, 99=17503, 99.9=47391, 99.99=68735] [UPDATE-FAILED: Count=395, Max=47, Min=5, Avg=15.56, 90=28, 99=38, 99.9=47, 99.99=47] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:48:30:936 460 sec: 446247 operations; 1079.1 current ops/sec; est completion in 9 minutes [READ: Count=10282, Max=27599, Min=378, Avg=970.1, 90=1794, 99=4159, 99.9=8103, 99.99=26623] [UPDATE-FAILED: Count=509, Max=47, Min=4, Avg=14.26, 90=24, 99=40, 99.9=43, 99.99=47] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:48:40:936 470 sec: 456925 operations; 1067.8 current ops/sec; est completion in 9 minutes [READ: Count=10128, Max=43711, Min=382, Avg=984.4, 90=1799, 99=4415, 99.9=11551, 99.99=35807] [UPDATE-FAILED: Count=550, Max=1575, Min=4, Avg=17.48, 90=25, 99=39, 99.9=72, 99.99=1575] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:48:50:936 480 sec: 466704 operations; 977.9 current ops/sec; est completion in 9 minutes [READ: Count=9248, Max=41503, Min=384, Avg=1078.63, 90=1811, 99=5875, 99.9=23711, 99.99=36383] [UPDATE-FAILED: Count=531, Max=72, Min=4, Avg=14.44, 90=22, 99=41, 99.9=55, 99.99=72] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:49:00:936 490 sec: 477243 operations; 1053.9 current ops/sec; est completion in 8 minutes [READ: Count=10032, Max=45887, Min=388, Avg=993.76, 90=1809, 99=4467, 99.9=11407, 99.99=42591] [UPDATE-FAILED: Count=509, Max=50, Min=4, Avg=14.73, 90=23, 99=43, 99.9=48, 99.99=50] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:49:10:936 500 sec: 487689 operations; 1044.6 current ops/sec; est completion in 8 minutes [READ: Count=9951, Max=40223, Min=401, Avg=1002.05, 90=1808, 99=4739, 99.9=14943, 99.99=31631] [UPDATE-FAILED: Count=493, Max=62, Min=4, Avg=14.38, 90=24, 99=38, 99.9=62, 99.99=62] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:49:20:936 510 sec: 498564 operations; 1087.5 current ops/sec; est completion in 8 minutes [READ: Count=10331, Max=19951, Min=380, Avg=964.52, 90=1840, 99=3431, 99.9=6783, 99.99=10719] [UPDATE-FAILED: Count=544, Max=67, Min=4, Avg=14.92, 90=24, 99=42, 99.9=50, 99.99=67] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:49:30:936 520 sec: 509661 operations; 1109.7 current ops/sec; est completion in 8 minutes [READ: Count=10557, Max=11231, Min=402, Avg=944, 90=1783, 99=3259, 99.9=6119, 99.99=7235] [UPDATE-FAILED: Count=540, Max=1261, Min=5, Avg=18.75, 90=25, 99=40, 99.9=975, 99.99=1261] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:49:40:936 530 sec: 520210 operations; 1054.9 current ops/sec; est completion in 8 minutes [READ: Count=9995, Max=27823, Min=403, Avg=997.63, 90=1846, 99=4223, 99.9=7415, 99.99=25487] [UPDATE-FAILED: Count=554, Max=79, Min=4, Avg=15.51, 90=25, 99=53, 99.9=76, 99.99=79] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:49:50:936 540 sec: 531414 operations; 1120.4 current ops/sec; est completion in 7 minutes [READ: Count=10641, Max=8887, Min=368, Avg=936.72, 90=1776, 99=3195, 99.9=6379, 99.99=7911] [UPDATE-FAILED: Count=563, Max=1101, Min=4, Avg=17.57, 90=28, 99=43, 99.9=74, 99.99=1101] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:50:00:936 550 sec: 540506 operations; 909.2 current ops/sec; est completion in 7 minutes [READ: Count=8638, Max=50751, Min=401, Avg=1153.55, 90=1889, 99=7055, 99.9=27279, 99.99=47231] [UPDATE-FAILED: Count=454, Max=1181, Min=4, Avg=17.44, 90=25, 99=39, 99.9=1181, 99.99=1181] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:50:10:936 560 sec: 549933 operations; 942.7 current ops/sec; est completion in 7 minutes [READ: Count=8929, Max=56511, Min=387, Avg=1116.61, 90=1842, 99=6655, 99.9=33695, 99.99=50943] [UPDATE-FAILED: Count=498, Max=49, Min=4, Avg=15.18, 90=27, 99=39, 99.9=49, 99.99=49] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:50:20:936 570 sec: 556657 operations; 672.4 current ops/sec; est completion in 7 minutes [READ: Count=6353, Max=92991, Min=409, Avg=1571.41, 90=2005, 99=18767, 99.9=54143, 99.99=83199] [UPDATE-FAILED: Count=371, Max=1349, Min=4, Avg=18.41, 90=21, 99=40, 99.9=1349, 99.99=1349] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:50:30:936 580 sec: 567450 operations; 1079.3 current ops/sec; est completion in 7 minutes [READ: Count=10253, Max=43967, Min=408, Avg=972.29, 90=1794, 99=4041, 99.9=7691, 99.99=29279] [UPDATE-FAILED: Count=540, Max=793, Min=4, Avg=16.68, 90=28, 99=41, 99.9=49, 99.99=793] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:50:40:936 590 sec: 578172 operations; 1072.2 current ops/sec; est completion in 7 minutes [READ: Count=10183, Max=20047, Min=402, Avg=979.08, 90=1849, 99=3453, 99.9=7059, 99.99=9159] [UPDATE-FAILED: Count=540, Max=56, Min=4, Avg=15.49, 90=27, 99=39, 99.9=50, 99.99=56] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:50:50:936 600 sec: 589169 operations; 1099.7 current ops/sec; est completion in 6 minutes [READ: Count=10432, Max=11191, Min=393, Avg=955.51, 90=1818, 99=3211, 99.9=6607, 99.99=9031] [UPDATE-FAILED: Count=564, Max=50, Min=5, Avg=14.88, 90=25, 99=33, 99.9=40, 99.99=50] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
13:50:51.046 [MongoDB Pinger - mongodb-1:27017] INFO  c.a.m.client.state.ClusterPinger - Could not ping 'mongodb-1:27017': mongodb-1
2016-05-08 13:51:00:936 610 sec: 599373 operations; 1020.4 current ops/sec; est completion in 6 minutes [READ: Count=9736, Max=74879, Min=379, Avg=1023.5, 90=1773, 99=5611, 99.9=23231, 99.99=44191] [UPDATE-FAILED: Count=468, Max=3209, Min=4, Avg=20.97, 90=22, 99=39, 99.9=3209, 99.99=3209] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:51:10:936 620 sec: 609834 operations; 1046.1 current ops/sec; est completion in 6 minutes [READ: Count=9945, Max=55679, Min=369, Avg=1000.4, 90=1781, 99=5219, 99.9=24751, 99.99=36991] [UPDATE-FAILED: Count=516, Max=22255, Min=4, Avg=57.3, 90=24, 99=39, 99.9=54, 99.99=22255] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:51:20:936 630 sec: 621176 operations; 1134.2 current ops/sec; est completion in 6 minutes [READ: Count=10808, Max=40735, Min=389, Avg=922.38, 90=1760, 99=3587, 99.9=6935, 99.99=35103] [UPDATE-FAILED: Count=535, Max=50, Min=4, Avg=14.29, 90=24, 99=40, 99.9=42, 99.99=50] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:51:30:936 640 sec: 632828 operations; 1165.2 current ops/sec; est completion in 6 minutes [READ: Count=11074, Max=24271, Min=387, Avg=900.3, 90=1751, 99=3237, 99.9=5827, 99.99=11295] [UPDATE-FAILED: Count=577, Max=52, Min=5, Avg=14.49, 90=26, 99=40, 99.9=51, 99.99=52] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:51:40:936 650 sec: 644333 operations; 1150.5 current ops/sec; est completion in 5 minutes [READ: Count=10901, Max=10983, Min=394, Avg=914.82, 90=1739, 99=3313, 99.9=6955, 99.99=10551] [UPDATE-FAILED: Count=605, Max=46, Min=4, Avg=13.79, 90=21, 99=40, 99.9=41, 99.99=46] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:51:50:936 660 sec: 655742 operations; 1140.9 current ops/sec; est completion in 5 minutes [READ: Count=10818, Max=13927, Min=392, Avg=921.64, 90=1762, 99=3273, 99.9=6583, 99.99=7323] [UPDATE-FAILED: Count=590, Max=794, Min=4, Avg=15.71, 90=25, 99=40, 99.9=56, 99.99=794] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:52:00:936 670 sec: 664897 operations; 915.5 current ops/sec; est completion in 5 minutes [READ: Count=8698, Max=175103, Min=382, Avg=1146.51, 90=1856, 99=6623, 99.9=36767, 99.99=66687] [UPDATE-FAILED: Count=457, Max=1118, Min=5, Avg=17.23, 90=24, 99=40, 99.9=1118, 99.99=1118] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:52:10:936 680 sec: 674343 operations; 944.6 current ops/sec; est completion in 5 minutes [READ: Count=8945, Max=49535, Min=398, Avg=1113.38, 90=1847, 99=7251, 99.9=27519, 99.99=42815] [UPDATE-FAILED: Count=501, Max=51, Min=5, Avg=15.35, 90=26, 99=40, 99.9=48, 99.99=51] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:52:20:936 690 sec: 681566 operations; 722.3 current ops/sec; est completion in 5 minutes [READ: Count=6845, Max=76543, Min=377, Avg=1460.25, 90=1982, 99=17471, 99.9=42527, 99.99=69311] [UPDATE-FAILED: Count=378, Max=77, Min=4, Avg=16.03, 90=29, 99=40, 99.9=77, 99.99=77] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:52:30:936 700 sec: 692246 operations; 1068 current ops/sec; est completion in 5 minutes [READ: Count=10163, Max=53695, Min=393, Avg=981.14, 90=1791, 99=4061, 99.9=8727, 99.99=26335] [UPDATE-FAILED: Count=518, Max=1654, Min=5, Avg=17.65, 90=24, 99=39, 99.9=46, 99.99=1654] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:52:40:936 710 sec: 703095 operations; 1084.9 current ops/sec; est completion in 5 minutes [READ: Count=10311, Max=32575, Min=377, Avg=966.2, 90=1775, 99=3899, 99.9=7319, 99.99=15375] [UPDATE-FAILED: Count=537, Max=75, Min=4, Avg=14.67, 90=24, 99=40, 99.9=50, 99.99=75] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:52:50:936 720 sec: 713314 operations; 1021.9 current ops/sec; est completion in 4 minutes [READ: Count=9667, Max=39327, Min=402, Avg=1031.17, 90=1884, 99=3965, 99.9=7771, 99.99=27551] [UPDATE-FAILED: Count=552, Max=76, Min=4, Avg=15.44, 90=26, 99=46, 99.9=56, 99.99=76] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:53:00:936 730 sec: 722854 operations; 954 current ops/sec; est completion in 4 minutes [READ: Count=9091, Max=529407, Min=373, Avg=1097.18, 90=1799, 99=5119, 99.9=28415, 99.99=55711] [UPDATE-FAILED: Count=449, Max=77, Min=4, Avg=16.53, 90=30, 99=43, 99.9=77, 99.99=77] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:53:10:936 740 sec: 733137 operations; 1028.3 current ops/sec; est completion in 4 minutes [READ: Count=9743, Max=26799, Min=400, Avg=1021.64, 90=1835, 99=4447, 99.9=9271, 99.99=26543] [UPDATE-FAILED: Count=540, Max=1030, Min=4, Avg=18.39, 90=28, 99=48, 99.9=67, 99.99=1030] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:53:20:936 750 sec: 743862 operations; 1072.5 current ops/sec; est completion in 4 minutes [READ: Count=10195, Max=28975, Min=387, Avg=977.95, 90=1803, 99=4013, 99.9=7887, 99.99=25759] [UPDATE-FAILED: Count=530, Max=55, Min=4, Avg=15.76, 90=29, 99=42, 99.9=52, 99.99=55] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:53:30:936 760 sec: 754579 operations; 1071.7 current ops/sec; est completion in 4 minutes [READ: Count=10180, Max=43807, Min=398, Avg=979.32, 90=1793, 99=4099, 99.9=7399, 99.99=22319] [UPDATE-FAILED: Count=537, Max=44, Min=4, Avg=15.34, 90=29, 99=40, 99.9=40, 99.99=44] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:53:40:936 770 sec: 765529 operations; 1095 current ops/sec; est completion in 3 minutes [READ: Count=10428, Max=15935, Min=373, Avg=956.03, 90=1800, 99=3515, 99.9=7359, 99.99=11775] [UPDATE-FAILED: Count=522, Max=74, Min=4, Avg=15.06, 90=28, 99=47, 99.9=54, 99.99=74] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:53:50:936 780 sec: 775571 operations; 1004.2 current ops/sec; est completion in 3 minutes [READ: Count=9579, Max=35327, Min=397, Avg=1041.12, 90=1838, 99=4859, 99.9=21551, 99.99=34367] [UPDATE-FAILED: Count=463, Max=54, Min=5, Avg=15.69, 90=28, 99=42, 99.9=54, 99.99=54] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:54:00:936 790 sec: 786062 operations; 1049.1 current ops/sec; est completion in 3 minutes [READ: Count=10001, Max=48735, Min=386, Avg=996.78, 90=1774, 99=4707, 99.9=19455, 99.99=41215] [UPDATE-FAILED: Count=491, Max=2415, Min=4, Avg=19.85, 90=27, 99=40, 99.9=2415, 99.99=2415] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:54:10:936 800 sec: 795255 operations; 919.3 current ops/sec; est completion in 3 minutes [READ: Count=8770, Max=97407, Min=376, Avg=1137.62, 90=1811, 99=7027, 99.9=26895, 99.99=53727] [UPDATE-FAILED: Count=422, Max=56, Min=5, Avg=15.08, 90=24, 99=40, 99.9=56, 99.99=56] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:54:20:936 810 sec: 802121 operations; 686.6 current ops/sec; est completion in 3 minutes [READ: Count=6536, Max=80255, Min=396, Avg=1526.48, 90=1988, 99=17711, 99.9=44799, 99.99=79039] [UPDATE-FAILED: Count=331, Max=66, Min=4, Avg=17.1, 90=32, 99=47, 99.9=66, 99.99=66] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:54:30:936 820 sec: 812703 operations; 1058.2 current ops/sec; est completion in 3 minutes [READ: Count=10065, Max=38111, Min=376, Avg=990.77, 90=1810, 99=4323, 99.9=8123, 99.99=32015] [UPDATE-FAILED: Count=517, Max=50, Min=4, Avg=16.03, 90=29, 99=40, 99.9=50, 99.99=50] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:54:40:936 830 sec: 823528 operations; 1082.5 current ops/sec; est completion in 2 minutes [READ: Count=10283, Max=15303, Min=366, Avg=969.71, 90=1808, 99=3565, 99.9=7127, 99.99=13855] [UPDATE-FAILED: Count=542, Max=61, Min=4, Avg=15.5, 90=28, 99=41, 99.9=53, 99.99=61] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:54:50:936 840 sec: 834639 operations; 1111.1 current ops/sec; est completion in 2 minutes [READ: Count=10559, Max=21839, Min=369, Avg=943.99, 90=1754, 99=3309, 99.9=6615, 99.99=12871] [UPDATE-FAILED: Count=551, Max=55, Min=4, Avg=15.18, 90=28, 99=40, 99.9=44, 99.99=55] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:55:00:936 850 sec: 843938 operations; 929.9 current ops/sec; est completion in 2 minutes [READ: Count=8840, Max=210303, Min=386, Avg=1127.36, 90=1837, 99=6191, 99.9=26895, 99.99=48063] [UPDATE-FAILED: Count=459, Max=66, Min=4, Avg=15.24, 90=26, 99=40, 99.9=66, 99.99=66] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:55:10:936 860 sec: 853286 operations; 934.8 current ops/sec; est completion in 2 minutes [READ: Count=8900, Max=42783, Min=389, Avg=1121.52, 90=2027, 99=5387, 99.9=20047, 99.99=29807] [UPDATE-FAILED: Count=448, Max=80, Min=4, Avg=15.67, 90=28, 99=40, 99.9=80, 99.99=80] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:55:20:936 870 sec: 864793 operations; 1150.7 current ops/sec; est completion in 2 minutes [READ: Count=10944, Max=29135, Min=381, Avg=909.98, 90=1730, 99=3289, 99.9=6679, 99.99=16895] [UPDATE-FAILED: Count=563, Max=59, Min=4, Avg=14.71, 90=23, 99=40, 99.9=53, 99.99=59] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:55:30:936 880 sec: 875911 operations; 1111.8 current ops/sec; est completion in 2 minutes [READ: Count=10591, Max=20351, Min=382, Avg=939.11, 90=1776, 99=3233, 99.9=6615, 99.99=8647] [UPDATE-FAILED: Count=527, Max=1556, Min=4, Avg=18.47, 90=27, 99=42, 99.9=91, 99.99=1556] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:55:40:936 890 sec: 886982 operations; 1107.1 current ops/sec; est completion in 1 minutes [READ: Count=10532, Max=25999, Min=377, Avg=946.85, 90=1766, 99=4199, 99.9=7575, 99.99=23727] [UPDATE-FAILED: Count=540, Max=51, Min=5, Avg=15.28, 90=27, 99=39, 99.9=45, 99.99=51] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:55:50:936 900 sec: 898476 operations; 1149.4 current ops/sec; est completion in 1 minutes [READ: Count=10899, Max=10135, Min=384, Avg=914.68, 90=1740, 99=3221, 99.9=6811, 99.99=8583] [UPDATE-FAILED: Count=594, Max=60, Min=4, Avg=14.7, 90=25, 99=40, 99.9=58, 99.99=60] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:56:00:936 910 sec: 909980 operations; 1150.4 current ops/sec; est completion in 1 minutes [READ: Count=10879, Max=25663, Min=393, Avg=916.38, 90=1745, 99=3323, 99.9=6727, 99.99=16479] [UPDATE-FAILED: Count=625, Max=53, Min=4, Avg=15.05, 90=27, 99=42, 99.9=50, 99.99=53] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:56:10:936 920 sec: 916778 operations; 679.8 current ops/sec; est completion in 1 minutes [READ: Count=6422, Max=75135, Min=396, Avg=1553.25, 90=2225, 99=18031, 99.9=36895, 99.99=53695] [UPDATE-FAILED: Count=376, Max=78, Min=4, Avg=16.14, 90=28, 99=45, 99.9=78, 99.99=78] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:56:20:936 930 sec: 923824 operations; 704.6 current ops/sec; est completion in 1 minutes [READ: Count=6688, Max=102143, Min=396, Avg=1492.49, 90=2005, 99=17455, 99.9=44927, 99.99=80575] [UPDATE-FAILED: Count=358, Max=84, Min=4, Avg=16.65, 90=28, 99=51, 99.9=84, 99.99=84] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:56:30:936 940 sec: 934137 operations; 1031.3 current ops/sec; est completion in 1 minutes [READ: Count=9778, Max=43807, Min=384, Avg=1019.63, 90=1817, 99=4671, 99.9=14231, 99.99=28735] [UPDATE-FAILED: Count=535, Max=1168, Min=4, Avg=16.83, 90=25, 99=40, 99.9=48, 99.99=1168] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:56:40:936 950 sec: 944798 operations; 1066.1 current ops/sec; est completion in 56 seconds [READ: Count=10118, Max=43167, Min=385, Avg=985.25, 90=1830, 99=3985, 99.9=7191, 99.99=38687] [UPDATE-FAILED: Count=543, Max=46, Min=4, Avg=15.01, 90=28, 99=39, 99.9=43, 99.99=46] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:56:50:936 960 sec: 954952 operations; 1015.4 current ops/sec; est completion in 46 seconds [READ: Count=9650, Max=39263, Min=395, Avg=1032.63, 90=1847, 99=5175, 99.9=19487, 99.99=26639] [UPDATE-FAILED: Count=504, Max=1055, Min=4, Avg=17.66, 90=28, 99=40, 99.9=52, 99.99=1055] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:57:00:936 970 sec: 966237 operations; 1128.5 current ops/sec; est completion in 34 seconds [READ: Count=10712, Max=14103, Min=404, Avg=930.41, 90=1772, 99=3425, 99.9=6683, 99.99=8095] [UPDATE-FAILED: Count=573, Max=41, Min=4, Avg=15.02, 90=27, 99=40, 99.9=40, 99.99=41] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:57:10:936 980 sec: 976337 operations; 1010 current ops/sec; est completion in 24 seconds [READ: Count=9577, Max=277759, Min=372, Avg=1041.23, 90=1826, 99=4791, 99.9=17439, 99.99=36927] [UPDATE-FAILED: Count=524, Max=49, Min=4, Avg=15.08, 90=27, 99=40, 99.9=47, 99.99=49] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:57:20:936 990 sec: 986696 operations; 1035.9 current ops/sec; est completion in 14 seconds [READ: Count=9827, Max=37887, Min=389, Avg=1014.49, 90=1818, 99=4523, 99.9=12103, 99.99=27423] [UPDATE-FAILED: Count=531, Max=63, Min=4, Avg=15.68, 90=26, 99=44, 99.9=61, 99.99=63] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
2016-05-08 13:57:30:936 1000 sec: 997154 operations; 1045.8 current ops/sec; est completion in 3 seconds [READ: Count=9930, Max=16271, Min=388, Avg=1004.23, 90=1915, 99=3575, 99.9=7095, 99.99=12967] [UPDATE-FAILED: Count=528, Max=70, Min=4, Avg=16.05, 90=28, 99=42, 99.9=57, 99.99=70] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
13:57:33.565 [MongoDB Pinger - Idle] DEBUG c.a.m.client.state.ClusterPinger - Pinger interrupted.
2016-05-08 13:57:33:565 1002 sec: 1000000 operations; 1082.54 current ops/sec; [READ: Count=2718, Max=9383, Min=416, Avg=963.72, 90=1818, 99=4085, 99.9=6619, 99.99=9383] [UPDATE-FAILED: Count=128, Max=41, Min=5, Avg=16.16, 90=27, 99=40, 99.9=41, 99.99=41] [CLEANUP: Count=1, Max=1724, Min=1724, Avg=1724, 90=1724, 99=1724, 99.9=1724, 99.99=1724] [UPDATE: Count=0, Max=0, Min=9223372036854775807, Avg=�, 90=0, 99=0, 99.9=0, 99.99=0] 
[OVERALL], RunTime(ms), 1002632.0
[OVERALL], Throughput(ops/sec), 997.3749092388832
[READ], Operations, 949940.0
[READ], AverageLatency(us), 1052.0766880013475
[READ], MinLatency(us), 365.0
[READ], MaxLatency(us), 529407.0
[READ], 95thPercentileLatency(us), 2065.0
[READ], 99thPercentileLatency(us), 4951.0
[READ], Return=OK, 949940
[UPDATE-FAILED], Operations, 50060.0
[UPDATE-FAILED], AverageLatency(us), 18.101598082301237
[UPDATE-FAILED], MinLatency(us), 4.0
[UPDATE-FAILED], MaxLatency(us), 22255.0
[UPDATE-FAILED], 95thPercentileLatency(us), 34.0
[UPDATE-FAILED], 99thPercentileLatency(us), 56.0
[CLEANUP], Operations, 1.0
[CLEANUP], AverageLatency(us), 1724.0
[CLEANUP], MinLatency(us), 1724.0
[CLEANUP], MaxLatency(us), 1724.0
[CLEANUP], 95thPercentileLatency(us), 1724.0
[CLEANUP], 99thPercentileLatency(us), 1724.0
[UPDATE], Operations, 0.0
[UPDATE], AverageLatency(us), NaN
[UPDATE], MinLatency(us), 9.223372036854776E18
[UPDATE], MaxLatency(us), 0.0
[UPDATE], 95thPercentileLatency(us), 0.0
[UPDATE], 99thPercentileLatency(us), 0.0
[UPDATE], Return=NOT_FOUND, 50060